"""
Конфигурационный файл ...
"""
import re
from typing import Any, Dict, List

# ====================================================================
# 1. КОЛОНКИ ДЛЯ ФАЙЛА breakpoint_data.xlsx
# ====================================================================

# 1. int колонки
BP_DATA_INT_COLS: List[str] = [
    'Quantity', 'Quantity in SS', 'Quantity per Vehicle Before',
    'Quantity per Vehicle After', 'Quantity per Box Before',
    'Quantity per Box After', 'Quantity batches in SS'
]

# 2. float колонки
BP_DATA_FLOAT_COLS: List[str] = [

]

# 3. datetime колонки
BP_DATA_DATETIME_COLS: List[str] = [
    'Change Date', 'New Part Available Date'
]

# 4. Колонки на русском
BP_DATA_TRANSLATION_COLS: List[str] = [
    'Номер переключения', 'Статус переключения', 'Партия по плану', 'Дата выхода новой детали',
    'Партия по факту', 'Дата переключения', 'Модель', 'Номер "старой" детали до переключения',
    'Название "старой" детали до переключения',
    'Количество "старых" деталей до переключения на Safety Stock',
    'Количество партий со "старыми" деталями до переключения',
    'Конфигурация для использования остатка "старых" деталей',
    'Партии для использования остатка "старых" деталей',
    'Привод (трансмиссия)', 'Номер "новой" детали после переключения',
    'Название "новой" детали после переключения',
    'Код производственной линии "старой" детали до переключения',
    'Название производственной линии "старой" детали до переключения',
    'Код производственной линии "новой" детали после переключения',
    'Название производственной линии "новой" детали после переключения',
    'Количество "старых" деталей до переключения на 1 авто',
    'Количество "новых" деталей после переключения на 1 авто',
    'Количество "старых" деталей до переключения на 1 ящик',
    'Количество "новых" деталей после переключения на 1 ящик',
    'Размеры ящика (Д-Ш-В) до переключения',
    'Размеры ящика (Д-Ш-В) после переключения',
    'Размеры поддона (Д-Ш-В) до переключения',
    'Размеры поддона (Д-Ш-В) после переключения',
    'Использование "старых" деталей до переключения в производстве',
    'Взаимозаменяемость "старых/новых" деталей до/после переключения',
    'Название поставщика до переключения', 'Локализация до переключения',
    'Название поставщика после переключения', 'Локализация после переключения',
    'Описание переключения', 'Решение переключения', 'Код цвета',
    'Название цвета', 'Комментарии',
]


# ====================================================================
# 2. КОЛОНКИ ДЛЯ ФАЙЛОВ BP<номер>.xlsx
# ====================================================================

# 1. Колонки с необходимыми данными
BP_GMOM_TO_KEEP_COLS: List[str] = [
    'Change', 'BOM Product', 'Update Type', 'Part No.', 'Part Name(CHN)',
    'Quantity', 'Supplier Name', 'Change Description', 'Solution',
    'Color Code', 'Color Name', 'Production Part Disposal',
    'Interchangeable', 'In Stock', 'New Part Available Date',
    'Workcenter No.', 'Workcenter Name',
]

# 2. int колонки
BP_GBOM_INT_COLS: List[str] = [
    'Quantity',
]

# 3. float колонки
BP_GBOM_FLOAT_COLS: List[str] = [

]

# 4. datetime колонки
BP_GBOM_DATETIME_COLS: List[str] = [
    'New Part Available Date',
]


# ====================================================================
# 3. ПРАВИЛА ОПРЕДЕЛЕНИЯ КОЛОНОК ПО ДАННЫМ
# ====================================================================
bp_pattern = re.compile(r'^BP\d{6,8}$', re.IGNORECASE)

# 1. Правила для файла bp_list.xlsx
BP_LIST_DETECTION_RULES: Dict[str, Dict[str, Any]] = {
    'type': {
        'expected_values': ['No', 'no', 'NO', 'Yes', 'yes', 'YES'],
        'description': 'тип BP (No/Yes)'
    },
    'status': {
        'expected_values': ['Closed', 'closed', 'CLOSED', 'Approved', 'approved', 'APPROVED', 'Published', 'published', 'PUBLISHED'],
        'description': 'статус BP (Closed/Open/Published)'
    },
    'bp': {
        'expected_values': [bp_pattern],
        'description': 'номер BP (начинается с BP)'
    },
    'part_name_e': {
        'expected_values': ['Software', 'software', 'SOFTWARE', 'Part', 'part', 'PART', 'Assy', 'assy', 'ASSY'],
        'description': 'название детали на английском'
    },
}

# 2. Правила для файла breakpoint_data.xlsx
BP_DATA_DETECTION_RULES: Dict[str, Dict[str, Any]] = {
    'bp_no': {
        'expected_values': [bp_pattern],
        'description': 'номер BP (начинается с BP)'
    }
}


# ====================================================================
# 4. НАСТРОЙКИ СТИЛЕЙ И ВИЗУАЛЬНОГО ОФОРМЛЕНИЯ EXCEL
# ====================================================================

# Цвета оформления (HEX-коды)
EXCEL_THEME_COLORS: Dict[str, str] = {
    'warehouse_bg': '#FDE9D9',      # Нежно-оранжевый для кладовщиков
    'warehouse_text': 'black',
    'header_bg': '#0F243E',         # Тёмно-синий для технических заголовков
    'header_text': 'white',
    'data_bg': '#FFFFFF'            # Белый фон для обычных ячеек
}

# Ширина колонок по их индексам
EXCEL_COLUMN_WIDTHS: Dict[int, int] = {
    0: 25, 1: 25, 2: 25, 3: 25, 4: 25, 5: 25, 6: 25, 7: 25,
    8: 80, 9: 25, 10: 25, 11: 25, 12: 25, 13: 25, 14: 25,
    15: 80, 16: 30, 17: 50, 18: 30, 19: 50,
    20: 30, 21: 30, 22: 30, 23: 30, 24: 30, 25: 30, 26: 30, 27: 30,
    28: 50, 29: 50, 30: 80, 31: 25, 32: 80, 33: 25,
    34: 100, 35: 100, 36: 25, 37: 25, 38: 100,
}
